# 运营商参数代码
ISP = {
    "1": "中国移动",
    "2": "中国移动数据卡",
    "3": "中国移动物联网",
    "4": "中国移动虚拟运营商",
    "5": "中国联通",
    "6": "中国联通虚拟运营商",
    "9": "中国电信",
    "10": "中国电信虚拟运营商",
    "14": "中国广电",
    "16": "虚拟号"
}

# 省份代码表
PROVINCES = {
    "11": "北京", "12": "天津", "13": "河北", "14": "山西", "15": "内蒙古",
    "21": "辽宁", "22": "吉林", "23": "黑龙江",
    "31": "上海", "32": "江苏", "33": "浙江", "34": "安徽", "35": "福建", "36": "江西", "37": "山东",
    "41": "河南", "42": "湖北", "43": "湖南", "44": "广东", "45": "广西", "46": "海南",
    "50": "重庆", "51": "四川", "52": "贵州", "53": "云南", "54": "西藏",
    "61": "陕西", "62": "甘肃", "63": "青海", "64": "宁夏", "65": "新疆",
    "81": "香港", "82": "澳门", "83": "台湾"
}
